Repository: Cristofer3097/gym
Catalog: l10n/app_*.arb
Languages: es

# appTitle
source: Gym Diary
es: Diario de Gimnasio

source: Start Training
es: Iniciar Entrenamiento

source: Templates
es: Plantillas

# noTemplatesSaved
source: No saved templates. Create a new one or save a workout!
es: No hay plantillas guardadas. ¡Crea una nueva o guarda un entrenamiento!

source: Calendar
es: Calendario

# tipsAndExtras
source: Tips & Extras
es: Tips y Extras

# languageButtonLabel
source: Lang
es: Idioma

# changeLanguageDialogTitle
source: Change Language
es: Cambiar Idioma

# languageSpanish
source: EspaÃ±ol
es: Español

source: Close
es: Cerrar

source: Cancel
es: Cancelar

# returnbutton
source: Return
es: Regresar

# deleteButton
source: Delete
es: Borrar

source: Title
es: Título

source: Save
es: Guardar

source: Weight
es: Peso

# serie
source: Set
es: Serie

source: Notes:
es: Notas:

# addExerciseButton
source: Add Exer.
es: Añadir Ejer.

# createTemplateButton
source: Create Template
es: Crear Plantilla

# addExercisesToTraining
source: Add exercises to your training.
es: Añade ejercicios a tu entrenamiento.

# training_title
source: Training
es: Entrenamiento

# training_title_date
source: Training of {formattedDate}
es: Entrenamiento del {formattedDate}

# training_exercise_loading
source: Loading available exercises...
es: Cargando ejercicios disponibles...

# training_db_error
source: Error loading exercises: {e}
es: Error al cargar los ejercicios de: {e}

# training_add_exercise
source: Add Exercise
es: Añadir Ejercicio

# training_create_template
source: Create Template
es: Crear Plantilla

# training_add_exercises_to_training
source: Add exercises to your training.
es: Añade ejercicios a tu entrenamiento.

# training_finish_and_save
source: Finish and Save Training
es: Terminar y Guardar Entrenamiento

# training_search_exercise
source: Search exercise
es: Buscar ejercicio

# training_new_exercise
source: Create New Exercise
es: Crear Nuevo Ejercicio

# training_new_title
source: Create New Exercise
es: Crear Nuevo Ejercicio

# training_edit_title
source: Edit Exercise
es: Editar Ejercicio

# training_name_exercise
source: Exercise name *
es: Nombre del ejercicio *

# training_name_exercise_hint
source: Ej: Bench Press
es: Ej: Press de Banca

# training_name_exercise_required
source: Exercise name is required
es: El nombre es requerido

# training_description
source: Description (optional)
es: Descripción (opcional)

# training_description_hint
source: Ej: Main movement for pecs...
es: Ej: Movimiento principal para pectorales...

# training_image
source: Image (optional):
es: Imagen (opcional):

# training_gallery
source: Gallery
es: Galería

# training_camera
source: Camera
es: Cámara

# training_image_quit
source: Quit Image
es: Quitar Imagen

# training_name_duplicated
source: The name already exists
es: El nombre ya existe

# training_name_message
source: There is already an exercise with the name '{trimmedName}'. Please choose a different name.
es: Ya existe otro ejercicio con el nombre {trimmedName}. Por favor, elige un nombre diferente.

# training_name_confirm
source: Confirm and Save
es: Confirmar y Guardar

# training_name_edit
source: Save Changes
es: Guardar Cambios

# training_template_save
source: Save as New Template
es: Guardar como Nueva Plantilla

# training_template_name
source: Template name *
es: Nombre de la plantilla *

# training_template_name_message
source: Template name cannot be empty.
es: El nombre de la plantilla no puede estar vacío.

# training_template_button
source: Save template
es: Guardar plantilla

# training_template_duplicate
source: Name Duplicated
es: Nombre Duplicado

# training_template_duplicate_message
source: There is already a template with the name '{templateNameFromDialog}'. Please choose a different name.
es: Ya existe una plantilla con el nombre {templateNameFromDialog}. Por favor, elige un nombre diferente.

# training_template_success
source: Template '{name}' saved
es: Plantilla '{name}' guardada

# training_quit_confirm
source: Yes, Quit
es: Sí, Quitar

# training_quit_message
source: Quit '{exerciseName}' from training? Entered data for this exercise will be lost.
es: ¿Quitar {exerciseName} del entrenamiento? Los datos ingresados para este ejercicio se perderán.

# training_edit
source: Edit Training Title
es: Editar Título del Entrenamiento

# training_edit_message
source: The exercise '{exerciseName}' has no series defined.
es: El ejercicio '{exerciseName}' no tiene series definidas.

# training_edit_reps_message
source: Incomplete repetition data for '{exerciseName}'.
es: Datos de repeticiones incompletos para '{exerciseName}'.

# training_edit_weight_message
source: Incomplete weight data for '{exerciseName}'.
es: Datos de peso incompletos para '{exerciseName}'.

# training_edit_weight_units_message
source: Incomplete weight units for '{exerciseName}'.
es: Unidades de peso incompletas para '{exerciseName}'.

source: Finish and Save Training
es: Terminar y Guardar Entrenamiento

# training_confirm_finish
source: Finish Training
es: Terminar Entrenamiento

# training_confirm_finish_message
source: Save and finish current training?
es: ¿Guardar y terminar el entrenamiento actual?

source: Go
es: Iniciar

# training_save_success
source: Training '{currentSessionTitle}' saved successfully
es: Entrenamiento '{currentSessionTitle}' guardado con éxito

# training_save_error
source: Error saving training
es: Error al guardar entrenamiento

# training_no_name
source: Exercise without name
es: Ejercicio sin nombre

# training_delete_exercise
source: Delete Exercise?
es: ¿Borrar Ejercicio?

# training_delete_exercise_message
source: '{exerciseNameForDialog}' will be permanently deleted from the list of available exercises. This action cannot be undone.
es: '{exerciseNameForDialog}' se eliminará permanentemente de la lista de ejercicios disponibles. Esta acción no se puede deshacer.

# training_delete_exercise_success
source: Exercise '{exerciseNameForDialog}' deleted
es: Ejercicio '{exerciseNameForDialog}' eliminado

# yesSaveChanges
source: Yes, Save
es: Sí, Guardar

# training_required
source: Permit Required
es: Permiso Requerido

# training_invalid
source: This function requires permissions that have been permanently denied. Please enable them in the application settings.
es: Esta función requiere permisos que fueron denegados permanentemente. Por favor, habilítalos en la configuración de la aplicación.

# training_required_message
source: Open Settings
es: Abrir Configuración

# training_image_required
source: Please correct the errors.
es: Por favor, corrige los errores.

# training_cancel_training
source: Cancel Training
es: Cancelar Entrenamiento

# training_cancel_training_message
source: Unsaved data for the current training will be lost. Are you sure you want to exit?
es: Los datos del entrenamiento actual no guardados se perderán. ¿Seguro que quieres salir?

# training_cancel_exit
source: Yes, Exit
es: Sí, Salir

# training_exercise_required
source: Add at least one exercise to finish the training.
es: Añade al menos un ejercicio para terminar el entrenamiento.

# training_current
source: Current
es: Actual

# training_history
source: History
es: Historial

# training_history_all
source: All Records
es: Todos los Registros

# history_chart_description
source: Results of the five most recent records.
es: Resultados de los cinco registros más recientes.

# training_history_error
source: Error loading history
es: Error cargando historial

# history_exercise_error
source: No previous records for '{exerciseNameToQuery}'.
es: No hay registros anteriores para '{exerciseNameToQuery}'.

# training_num_series
source: Number of Series *
es: Número de Series *

# training_units
source: Unit
es: Unidad

# training_Details
source: Details by Set:
es: Detalles por Serie:

# training_details_text
source: Enter the number of sets.
es: Ingresa las números de series.

# training_details_text_2
source: Adjusting details for '{seriesCountFromInput}' sets...
es: Ajustando campos para '{seriesCountFromInput}' series...

# training_notes
source: Notes (optional)
es: Notas (opcional)

# training_notes_hint
source: Technique, feelings, etc.
es: Técnica, sensaciones, etc.

# training_register
source: Last Register:
es: Último Registro:

# training_register_error
source: No records for this exercise.
es: Sin registros para este ejercicio.

# training_date_unknown
source: Unknown Date
es: Fecha desconocida

# training_error_format
source: Error formatting registered date
es: Error al formatear fecha registrada

# training_update
source: Update Register
es: Actualizar Registro

# training_create_exercise
source: Exercise '{exerciseName}' created and available
es: Ejercicio '{exerciseName}' creado y disponible.

# training_quit_exercise
source: '{exerciseNameToRemove}' removed from training
es: '{exerciseNameToRemove}' quitado del entrenamiento

# training_quit_error
source: Error removing exercise. Invalid index.
es: Error al quitar el ejercicio. Índice inválido.

# training_set_recommend
source: Recommend less than 4 series to not overload training
es: Se recomienda menos de 4 series para no sobrentrenar

# training_set_error
source: Invalid number of series.
es: Número de series inválido.

# training_set_invalid
source: Invalid
es: Inválido

# training_error_form
source: Please correct the errors in the form.
es: Por favor, corrige los errores en el formulario.

# training_num_invalid
source: Invalid number of series.
es: Número de series inválido.

# training_num_max
source: Maximum 4 series allowed.
es: Máximo 4 series permitidas.

# training_weight_recommend
source: Recommend lowering the weight.
es: Se recomienda bajar el peso.

# training_weight_recommend2
source: Recommend raising the weight
es: Se recomienda subir el peso

# training_negative
source: Negative
es: No negativo

# training_selection_units
source: Select unit
es: Selecciona unidad

# training_description_unknown
source: No description available for this exercise.
es: No hay descripción disponible para este ejercicio.

# training_archive_error
source: Error loading preview of file
es: Error al cargar preview de archivo

# training_unselect_error
source: Cannot deselect an exercise with entered data.
es: No se puede deseleccionar un ejercicio con datos ingresados.

# training_unselect_title
source: Action not allowed
es: Acción no permitida

source: Template name cannot be empty.
es: El nombre de la plantilla no puede estar vacío.

# template_delete
source: Select Template to Delete
es: Selecciona Plantilla a Borrar

# template_donthave
source: No templates to delete.
es: No hay plantillas para borrar.

# template_id
source: Error: Template without ID
es: Error: Plantilla sin ID

# template_question
source: Delete template?
es: ¿Borrar plantilla?

# template_question1
source: Do you want to delete the template '{displayTemplateName}'? This action cannot be undone.
es: ¿Quieres eliminar la plantilla '{displayTemplateName}'? Esta acción no se puede deshacer.

# template_question2
source: Do you want to delete the template '{templateName}'? This action cannot be undone.
es: ¿Quieres eliminar la plantilla '{templateName}'? Esta acción no se puede deshacer.

# template_exercise
source: This template doesn't have exercises.
es: Esta plantilla no tiene ejercicios.

# templateDeletedSuccessMessage
source: Template '{displayTemplateName}' deleted.
es: Plantilla '{displayTemplateName}' eliminada.

source: Search exercise
es: Buscar ejercicio

source: Category
es: Categoría

# allCategories
source: All
es: Todas

# loadingOrNoExercises
source: Loading or no exercises defined...
es: Cargando o no hay ejercicios definidos...

# noExercisesFoundWithFilters
source: No exercises found with current filters.
es: No se encontraron ejercicios con los filtros actuales.

# deletePermanentlyTooltip
source: Delete permanently
es: Borrar permanentemente

# exerciseDeletedSuccess
source: Exercise '{exerciseName}' deleted.
es: Ejercicio '{exerciseName}' eliminado.

# createNewExerciseButton
source: Create New Exercise
es: Crear Nuevo Ejercicio

# removeExerciseDialogTitle
source: Remove Exercise
es: Quitar Ejercicio

# removeExerciseDialogContent
source: Remove '{exerciseName}' from training? Entered data for this exercise will be lost.
es: ¿Quitar '{exerciseName}' del entrenamiento? Los datos ingresados para este ejercicio se perderán.

source: Yes, Remove
es: Sí, Quitar

# exerciseRemovedSuccess
source: '{exerciseName}' removed from training
es: '{exerciseName}' quitado del entrenamiento

# errorRemovingExercise
source: Error removing exercise. Invalid index.
es: Error al quitar el ejercicio. Índice inválido.

# addExercisesToSaveTemplate
source: Add exercises to the training to save it as a template.
es: Añade ejercicios al entrenamiento para guardarlo como plantilla.

# tips_title
source: 💡 Tips & Tricks
es: 💡 Consejos Rápidos

# tips_rm_text
source: To find out your one-repetition maximum, use the following calculator:
es: Para conocer tu máximo de una repetición, utiliza la siguiente calculadora:

# tips_rm_is_title
source: What is RM?
es: ¿Qué es RM?

# tips_rm_is
source: RM (Maximum Repetition) and PR (Personal Record) are key concepts to measure progress and strength. PR is the maximum weight you've lifted in a particular exercise, while RM is the maximum weight you can lift in a single repetition, regardless of your personal record.
es: RM (Repetición Máxima) y PR (Personal Record) y son conceptos clave para medir el progreso y la fuerza. PR es el máximo peso que has levantado en un ejercicio en particular, mientras que RM es el peso máximo que puedes levantar en una sola repetición, independientemente de tu récord personal.

# tips_hypertrophy
source: What is Hypertrophy?
es: ¿Que es Hipertrofia?

# tips_hypertrophy_dialog
source: Muscle hypertrophy is the growth of muscles due to an increase in the size of muscle fibers. It is achieved through strength training that causes muscle damage and subsequent recovery with proper nutrition and rest, leading to new protein synthesis and fiber expansion.
es: La hipertrofia muscular es el crecimiento de los músculos debido al aumento del tamaño de las fibras musculares. Se logra a través de un entrenamiento de fuerza que provoque daño muscular y una posterior recuperación con adecuada alimentación y descanso, lo que lleva a la síntesis de nuevas proteínas y la expansión de las fibras.

# tips_hypertrophy_title
source: Hypertrophy
es: Hipertrofia

# tips_hypertrophy_text
source: Hypertrophy is the growth of muscles due to an increase in the size of muscle fibers. It is achieved through strength training that causes muscle damage and subsequent recovery with proper nutrition and rest, leading to new protein synthesis and fiber expansion.
es: La evidencia científica nos indica que el entrenamiento en un rango de repetición moderada (6-12 repeticiones) es la mejor manera de desarrollar masa muscular.

# tips_book
source: Recommended Book
es: Libro Recomendado

# tips_book_text
source: A book that helped me understand the importance of effective and high-intensity training.
es: Un libro que me ayudó a entender la importancia del entrenamiento efectivo y de alta intensidad.

# tips_book_link
source: Link to the book
es: Link del libro

# tips_book_link_error
source: Could not open link
es: No se pudo abrir el enlace

# tips_proof
source: Constancy
es: Constancia

# tips_proof_text
source: The key to progress is being constant with your workouts and nutrition. Remember that the proof leads to success.
es: La clave del progreso es ser constante con tus entrenamientos y nutrición. Recuerda que la constancia lleva a la superacion

# tips_Heating
source: Heating
es: Calentamiento

# tips_Heating_text
source: Don't forget to heat up before each session to prevent injuries and prepare your muscles.
es: No olvides calentar antes de cada sesión para prevenir lesiones y preparar tus músculos.

# tips_aprox
source: Approximation
es: Aproximidad

# tips_aprox_text
source: Before reaching your effective series, train 2 series with a 50-80% of your maximum weight and 2-4 repetitions below muscle strain.
es: Antes de llegar a tu serie efectiva, entrena 2 series con un peso del 50% - 80% de tu peso máximo y de 2-4 repeticiones por debajo del fallo moscular.

# tips_tec
source: Technique > Weight
es: Técnica > Peso

# tips_tec_text
source: Prioritize a good technique over lifting more weight, especially at the beginning. This maximizes effectiveness and prevents injuries.
es: Prioriza una buena técnica sobre levantar más peso, especialmente al iniciar. Esto maximiza la efectividad y previene lesiones.

# tips_avoid
source: Avoid overloading training
es: Evita la sobrecarga de entrenamiento

# tips_avoid_text
source: Perform between 6 and 7 exercises in a gym session. It's important to choose exercises that are effective for training goals and avoid overloading to avoid shoulder strain and injuries.
es: Realizar entre 6 y 7 ejercicios en una sesión de gimnasio. es importante elegir ejercicios que sean efectivos para los objetivos de entrenamiento y evitar la sobrecarga para evitar el escancamiento y lesiones.

# tips_progression
source: Progressive Growth
es: Progresión Gradual

# tips_progression_text
source: Increase the intensity but be patient, with 5 Lb increase in your maximum weight is enough for a good progression. If you do more than 10 reps it's time to move up in weight.
es: Aumenta la intensidad pero se paciente, con aumentar 5 Lb en tu peso maximo es suficiente para una buena progresion. Si haces mas de 10 repeticiones es hora de subir de peso.

# tips_rest
source: Rest
es: Descanso

# tips_rest_text
source: Rest is as important as exercise. Sleep well (7-9 hours) this allows your muscles to recover between sessions. I recommend a 48-72 hour rest between sessions for the same muscle group.
es: El descanso es tan importante como el ejercicio. Duerme bien (7-9 horas) eso permite que tus músculos se recuperen entre sesiones. Te recomiendo un descanso de 48 a 72 horas entre sesiones para el mismo grupo muscular.

# tips_series
source: Rest between series
es: Descanso entre series

# tips_series_text
source: 3 minutes between sets are ideal for workouts that seek to increase maximum strength and power. They allow for a more complete recovery of the neuromuscular and energy system, which facilitates greater intensity and volume in subsequent sets.
es: 3 minutos entre series son ideales para entrenamientos que buscan aumentar la fuerza máxima y la potencia. Permiten una recuperación más completa del sistema neuromuscular y energético, lo que facilita una mayor intensidad y volumen en las series subsecuentes.

# tips_nutrition
source: Nutrition
es: Nutrición

# tips_nutrition_text
source: A balanced diet is essential. It is important to reach your maintenance calories or with a little caloric surplus (100 - 200) is sufficient for muscle gains. (There are many websites to calculate your calorie needs). -Make sure you consume enough protein (1.8 grams of protein multiplied by your weight) for muscle repair. -Carbohydrates are also essential, pre-workout is crucial to optimize performance, especially in long duration or high intensity exercise. -Slow-absorbing carbohydrates, such as whole-grain bread or fruit, can help keep energy levels stable throughout your workout.
es: Una alimentación balanceada es fundamental. -Es importante llegar a tus calorias de mantenimiento o con un poco de superávit calórico (100 - 200) es suficiente para ganancias mosculares. (Hay muchas paginas web para calcular tus calorias necesarias) -Asegúrate de consumir suficientes proteínas (1.8 gr de proteina multiplicado por tu peso) para la reparación muscular. -Los Carbohidratos son tambien fundamentales, antes del entrenamiento es crucial para optimizar el rendimiento, especialmente en ejercicios de larga duración o alta intensidad. -Unos Carbohidratos de absorción lenta, como pan integral o frutas, puede ayudar a mantener los niveles de energía estables a lo largo del entrenamiento.

# tips_repositories
source: 🔗 Project Repository
es: 🔗 Repositorio del Proyecto

# tips_repositories_text
source: The source code for this application is available on GitHub. This project is open source, which means you can explore how it is built, propose improvements, or even use parts of the code for your own projects. Your contribution or feedback is always welcome.
es: El código fuente de esta aplicación está disponible en GitHub. Este proyecto es de código abierto, lo que significa que puedes explorar cómo está construido, proponer mejoras, o incluso utilizar partes del código para tus propios proyectos. Tu contribución o feedback es siempre bienvenido.

# tips_repositories_link
source: Visit Repository
es: Visitar Repositorio

# tips_project
source: 🚀 Why the Project
es: 🚀 El Porqué del Proyecto

# tips_project_text
source: This application, 'Gym Diary', was born from my personal need for a simple, direct and effective tool to keep a detailed record of my workouts at the gym. I was looking for something that would allow me to customize my routines, track my progress in sets, reps and weights, and have an accessible history but I was always finding service applications or with a very excessive cost to simply store numerical data, unnecessary and/or complex functions. The main goal is to provide a clear user experience, focused on the essential functionality for tracking strength training, allowing the user to concentrate on what's important: their progress and consistency. I sincerely hope you find this app useful in reaching your fitness goals - any feedback or suggestions for improvement would be greatly appreciated!
es: Esta aplicación, 'Gym Diary', nació de mi necesidad personal de contar con una herramienta simple, directa y efectiva para llevar un registro detallado de mis entrenamientos en el gimnasio. Buscaba algo que me permitiera personalizar mis rutinas, seguir mi progreso en series, repeticiones y pesos, y tener un historial accesible pero siempre me encontraba aplicaciones de servicio o con un costo muy escesivo para simplemente guardar datos numericos, funciones innecesarias y/o complejas. El objetivo principal es ofrecer una experiencia de usuario clara, enfocada en la funcionalidad esencial para el seguimiento del entrenamiento de fuerza, permitiendo al usuario concentrarse en lo importante: su progreso y constancia. Espero sinceramente que encuentres esta aplicación útil para alcanzar tus metas de fitness. ¡Cualquier comentario o sugerencia para mejorarla será muy apreciado!

# creatorCredit
source: Creator Cristofer3097
es: Creador Cristofer3097

# calculator_RM
source: RM Calculator
es: Calculadora RM

# calculator_warning
source: This is not precise and may lead to errors.
es: Esto no es preciso y puede generarte ciertos errores.

# calculator_required
source: Required
es: Requerido

# calculator_invalid
source: Invalid (>0)
es: Inválido (>0)

# calculator_error
source: Please correct the errors.
es: Por favor, corrige los errores.

# calculator_valid
source: Enter valid values to calculate.
es: Ingresa valores válidos para calcular.

# calendarFormatMonth
source: Month
es: Mes

# calendarFormatTwoWeeks
source: 2 Weeks
es: 2 Semanas

# calendarFormatWeek
source: Week
es: Semana

# calendar_title
source: Gym Training Calendar
es: Calendario de Entrenamientos

# calendar_confirm
source: Confirm Deletion of Session
es: Confirmar Borrado de Sesión

# confirmDeleteSessionDialogContent
source: Are you sure you want to delete the session '{sessionTitle}' and all its exercises? This action cannot be undone.
es: ¿Seguro que quieres borrar la sesión '{sessionTitle}' y todos sus ejercicios? Esta acción no se puede deshacer.
