Repository: Cristofer3097/gym
Catalog: l10n/app_*.arb
Languages: es

# calendar_selection
source: Select an action for this training session.
es: Selecciona una acción para esta sesión de entrenamiento.

# calendar_action
source: Actions for: '{sessionTitle}
es: Acciones para: '{sessionTitle}

# calendar_session_delete
source: Session '{sessionTitle}' deleted.
es: Sesión '{sessionTitle}' eliminada.

# calendar_notes
source: Notes: '{notes}'
es: Notas: '{notes}'

# calendar_date
source: Trainings of {date}:
es: Entrenamientos del {date}:

# calendar_no_sessions
source: No training sessions recorded for this day.
es: No hay sesiones de entrenamiento registradas para este día.

# calendar_select
source: Select a day to view sessions.
es: Selecciona un día para ver las sesiones.

# calendar_loading
source: Loading sessions...
es: Cargando ejercicios...

# calendar_error
source: No exercises in this session.
es: No hay ejercicios en esta sesión.

# settings_title
source: Settings
es: Configuración

# settings_loading_export
source: Creating backup...
es: Creando copia de seguridad...

# settings_loading_import
source: Restoring backup...
es: Restaurando copia...

# settings_error_no_db_in_backup
source: The backup file is corrupt or does not contain the database (gym_diary.db).
es: El archivo de copia de seguridad está corrupto o no contiene la base de datos (gym_diary.db).

# settings_section_data
source: Application Data
es: Datos de la Aplicación

# settings_language
source: Language
es: Idioma

# settings_language_subtitle
source: Change the application's language
es: Cambiar el idioma de la aplicación

# settings_export
source: Export data (Backup)
es: Exportar datos (Copia de seguridad)

# settings_export_subtitle
source: Save the database to a file
es: Guardar la base de datos en un archivo

# settings_export_dialog_title
source: Select where to save the backup
es: Selecciona dónde guardar la copia

# settings_export_success
source: Backup saved to: {path}
es: Copia de seguridad guardada en: {path}

# settings_import
source: Import data (Restore)
es: Importar datos (Restaurar)

# settings_import_subtitle
source: Restore data from a backup file
es: Restaurar datos desde un archivo

# settings_import_warning_title
source: Warning!
es: ¡Atención!

# settings_import_warning_content
source: Importing a file will replace ALL of your current data. This action cannot be undone. Do you wish to continue?
es: Importar un archivo reemplazará TODOS tus datos actuales. Esta acción no se puede deshacer. ¿Deseas continuar?

# settings_import_confirm
source: Yes, Continue
es: Sí, Continuar

# settings_import_success
source: Import complete. Your data has been restored.
es: Importación completada. Los datos han sido restaurados.

# settings_permission_denied
source: Storage permission denied.
es: Permiso de almacenamiento denegado.

# settings_no_file_selected
source: No file selected.
es: No se seleccionó ningún archivo.

# settings_no_folder_selected
source: No folder selected.
es: No se seleccionó ninguna carpeta.

# settings_error
source: An error occurred: {error}
es: Ocurrió un error: {error}

# settings_permission_title
source: Permission Required
es: Permiso Requerido

# settings_permission_content
source: To export or import data, the application needs access to your storage. Please enable the permission in the app settings.
es: Para exportar o importar datos, la aplicación necesita acceso a su almacenamiento. Por favor, habilite el permiso en la configuración de la aplicación.

# settings_open_settings_button
source: Open Settings
es: Abrir Configuración

# category_all
source: All Categories
es: Todas las Categorías

# category_chest
source: Chest
es: Pecho

# category_back
source: Back
es: Espalda

# category_legs
source: Legs
es: Piernas

# category_shoulders
source: Shoulders
es: Hombros

# category_glutes
source: Glutes
es: Gluteos

# category_abs
source: Abs
es: Abdomen

# category_other
source: Other
es: Otro

# selectCategoryHint
source: Select a group
es: Selecciona un grupo

# selectCategoryValidator
source: Select a muscle group
es: Selecciona un grupo muscular

# exerciseOverlayNewExerciseCreated
source: Exercise '{exerciseName}' created and available.
es: Ejercicio '{exerciseName}' creado y disponible.

# exercise_0_name
source: Bench Press
es: Press de Banca con Barra

# exercise_0_description
source: The Bench Press is a classic strength training exercise that primarily targets the chest, shoulders, and triceps, contributing to upper body muscle development. It is suitable for anyone, from beginners to professional athletes, looking to improve their upper body strength and muscular endurance. Individuals may want to incorporate bench press into their routine for its effectiveness in enhancing physical performance, promoting bone health, and improving body composition.
es: El press de banca es un ejercicio clásico de entrenamiento de fuerza que se dirige principalmente al pecho, los hombros y los tríceps, contribuyendo al desarrollo muscular de la parte superior del cuerpo. Es adecuado para cualquier persona, desde principiantes hasta atletas profesionales, que busque mejorar la fuerza y la resistencia muscular de la parte superior del cuerpo. Las personas pueden querer incorporar el press de banca a su rutina por su eficacia para aumentar el rendimiento físico, promover la salud ósea y mejorar la composición corporal.

# exercise_1_name
source: Dumbbell bench press
es: Press de banca con mancuernas

# exercise_1_description
source: The Dumbbell Bench Press is a versatile strength-training exercise that primarily targets the chest, while also engaging the shoulders and triceps. It is suitable for both beginners and advanced fitness enthusiasts as it can be easily modified to match individual strength levels and goals. People might opt for this exercise as it promotes muscle growth, improves upper body strength, and offers better range of motion compared to a barbell bench press.
es: El press de banca con mancuernas es un ejercicio versátil de entrenamiento de fuerza que se dirige principalmente al pecho, pero también a los hombros y los tríceps. Es adecuado tanto para principiantes como para entusiastas avanzados del fitness, ya que puede modificarse fácilmente para adaptarse a los niveles de fuerza y objetivos individuales. La gente puede optar por este ejercicio, ya que promueve el crecimiento muscular, mejora la fuerza superior del cuerpo, y ofrece un mejor rango de movimiento en comparación con un press de banca con barra.

# exercise_2_name
source: Smith Bench Press
es: Press de banca Smith

# exercise_2_description
source: The Smith Bench Press is a strength-training exercise that primarily targets the chest muscles, while also engaging the shoulders and triceps. The Smith machine provides stability, allowing for controlled movements and focus on form. One would want to perform this exercise to build upper body strength, enhance muscle definition, and improve overall athletic performance.
es: El press de banca Smith es un ejercicio de entrenamiento de la fuerza que se dirige principalmente a los músculos pectorales, al tiempo que estimula los hombros y los tríceps. La máquina Smith proporciona estabilidad, lo que permite controlar los movimientos y centrarse en la forma. Se recomienda realizar este ejercicio para desarrollar la fuerza de la parte superior del cuerpo, aumentar la definición muscular y mejorar el rendimiento atlético general.

# exercise_3_name
source: Dumbbell Fly
es: Aperturas con Mancuernas

# exercise_3_description
source: The Dumbbell Fly is a strength training exercise targeting the chest muscles, specifically the pectoralis major, and secondary muscles like the shoulders and biceps. This exercise is beneficial for those looking to enhance their upper body strength, improve muscle definition, and promote better posture.
es: Las aperturas con Mancuernas es un ejercicio de entrenamiento de fuerza dirigido a los músculos pectorales, concretamente el pectoral mayor, y a músculos secundarios como los hombros y los bíceps. Este ejercicio es beneficioso para aquellos que buscan mejorar la fuerza de la parte superior del cuerpo, mejorar la definición muscular y promover una mejor postura.

# exercise_4_name
source: Lever Seated Fly
es: Aperturas en Máquina

# exercise_4_description
source: The Lever Seated Fly is a strength training exercise primarily targeting the chest muscles, while also engaging the shoulders and arms. The exercise is beneficial for enhancing muscle definition, improving posture, and boosting upper body strength, making it an ideal choice for those looking to increase their functional fitness or sculpt their physique.
es: Aperturas en Máquina es un ejercicio de entrenamiento de fuerza que se dirige principalmente a los músculos pectorales, a la vez que se trabajan los hombros y los brazos. El ejercicio es beneficioso para mejorar la definición muscular, la postura y la fuerza de la parte superior del cuerpo, por lo que es una opción ideal para aquellos que buscan aumentar su aptitud funcional o esculpir su físico.

# exercise_5_name
source: Incline Bench Press
es: Press Inclinado con Barra

# exercise_5_description
source: The Incline Bench Press is a strength-training exercise that primarily targets the upper portion of the chest muscles, while also engaging the shoulders and triceps. It's suitable for anyone looking to enhance upper body strength and improve muscle definition, particularly in the chest area.
es: El press de banca inclinado es un ejercicio de entrenamiento de fuerza que se dirige principalmente a la parte superior de los músculos pectorales, a la vez que se trabajan los hombros y los tríceps. Adecuado para cualquier persona que desee aumentar la fuerza de la parte superior del cuerpo y mejorar la definición muscular, especialmente en la zona pectoral.

# exercise_6_name
source: Dumbbel Incline Bench Press
es: Press Inclinado con Mancuernas

# exercise_6_description
source: The Dumbbell Incline Bench Press is a highly effective exercise primarily targeting the upper chest muscles, but also working the shoulders and triceps. Individuals may want to incorporate this exercise into their routine as it allows for a greater range of motion compared to the barbell version, promoting better muscle activation and growth.
es: El press de banca inclinado con mancuernas es un ejercicio muy eficaz que se dirige principalmente a los músculos de la parte superior del pecho, pero también trabaja los hombros y los tríceps. Las personas pueden querer incorporar este ejercicio en su rutina, ya que permite un mayor rango de movimiento en comparación con la versión de la barra, la promoción de una mejor activación muscular y el crecimiento.

# exercise_7_name
source: Lever Chest Press
es: Press de pecho en maquina

# exercise_7_description
source: The Lever Chest Press is a strength-building exercise that primarily targets the pectoral muscles, but also works the triceps and anterior deltoids. It is an excellent workout for both beginners and advanced fitness enthusiasts due to its adjustable resistance and controlled movement.
es: Press de pecho en maquina es un ejercicio de fortalecimiento que se dirige principalmente a los músculos pectorales, pero también trabaja los tríceps y los deltoides anteriores. Es un entrenamiento excelente tanto para principiantes como para entusiastas avanzados del fitness debido a su resistencia ajustable y movimiento controlado. Las personas pueden elegir este ejercicio por su capacidad para aumentar la fuerza de la parte superior del cuerpo, mejorar el tono muscular y contribuir al desarrollo de un pecho más definido.

# exercise_8_name
source: Chest Dip
es: Fondos en Paralelas

# exercise_8_description
source: The Chest Dip is a powerful exercise that primarily targets the pectoralis muscles, triceps, and the front shoulders, helping to build strength and definition in these areas. It is suitable for individuals at an intermediate or advanced fitness level who are aiming to enhance their upper body strength and muscular endurance.
es: Los Fondos en Paralelas es un potente ejercicio que se dirige principalmente a los músculos pectorales, los tríceps y la parte delantera de los hombros, lo que ayuda a aumentar la fuerza y la definición en estas zonas. Es adecuado para personas con un nivel de forma física intermedio o avanzado que deseen mejorar la fuerza y la resistencia muscular de la parte superior del cuerpo.

# exercise_9_name
source: Smith Incline Bench Press
es: Press de banca inclinado Smith

# exercise_9_description
source: The Smith Incline Bench Press is a strength-building exercise that primarily targets your upper chest, shoulders, and triceps, while also engaging other supporting muscles. It's suitable for both beginners and advanced athletes due to the controlled movement of the Smith machine, which can help prevent injury and ensure correct form.
es: El press de banca inclinado Smith es un ejercicio de desarrollo de la fuerza que se dirige principalmente a la parte superior del pecho, los hombros y los tríceps, a la vez que estimula otros músculos de apoyo. Es adecuado tanto para principiantes como para atletas avanzados debido al movimiento controlado de la máquina Smith, que puede ayudar a prevenir lesiones y garantizar una forma correcta.

# exercise_10_name
source: Cable Fly
es: Vuelo con cable

# exercise_10_description
source: Cable Fly is a targeted exercise that primarily strengthens the chest muscles, while also engaging the shoulders and arms. It's suitable for both beginners and experienced gym-goers, offering adjustable resistance to match individual fitness levels.
es: los Vuelos con cable es un ejercicio específico que fortalece principalmente los músculos pectorales, al tiempo que estimula los hombros y los brazos. Es adecuado tanto para principiantes como para deportistas experimentados, ya que ofrece una resistencia ajustable para adaptarse a cada nivel de forma física.

# exercise_11_name
source: Pulldown
es: Jalón en Polea Alta

# exercise_11_description
source: The Cable Pulldown is a popular strength training exercise that primarily targets the muscles in your back, specifically the latissimus dorsi, but also works your shoulders and arms. This exercise is ideal for both beginners and advanced fitness enthusiasts, as the weight can be easily adjusted to match individual strength levels. Incorporating Cable Pulldowns into your workout routine can help improve upper body strength, promote better posture, and enhance muscle definition.
es: El Jalón Abierto con cable es un popular ejercicio de entrenamiento de fuerza que se dirige principalmente a los músculos de la espalda, en concreto al dorsal ancho, pero también trabaja los hombros y los brazos. Este ejercicio es ideal tanto para principiantes como para entusiastas avanzados del fitness, ya que el peso puede ajustarse fácilmente para adaptarse a los niveles de fuerza individuales. Incorporar las dominadas con cable a su rutina de ejercicios puede ayudarle a mejorar la fuerza de la parte superior del cuerpo, mejorar la postura y aumentar la definición muscular.

# exercise_12_name
source: Pulldown with V-bar
es: Jalon con barra en V

# exercise_12_description
source: Pulldown with V-bar is a highly effective exercise that targets and strengthens the muscles in your back, shoulders, and arms, particularly the latissimus dorsi.
es: El pulldown con barra en V es un ejercicio muy eficaz que trabaja y fortalece los músculos de la espalda, los hombros y los brazos, especialmente el dorsal ancho.

# exercise_13_name
source: Pull-up
es: Dominada

# exercise_13_description
source: The Pull-up exercise is a highly beneficial upper body workout that targets multiple muscle groups, including the back, arms, shoulders, and chest, improving strength and endurance. It's an ideal exercise for anyone, from beginners to fitness enthusiasts, who are interested in building upper body strength and enhancing muscle definition.
es: La dominada es un ejercicio muy beneficioso para la parte superior del cuerpo que trabaja varios grupos musculares, como la espalda, los brazos, los hombros y el pecho, y mejora la fuerza y la resistencia. Es un ejercicio ideal para cualquier persona, desde principiantes hasta entusiastas del fitness, que estén interesados en desarrollar la fuerza de la parte superior del cuerpo y mejorar la definición muscular.

# exercise_14_name
source: Supination Pulldown on High Pulley
es: Jalón en Supinación en Polea Alta

# exercise_14_description
source: The Reverse-grip Straight Back Seated High Row is a strength-building exercise targeting your back muscles, particularly the lats, rhomboids, and traps. It's suitable for individuals at all fitness levels who want to improve their upper body strength and posture.
es: El remo alto sentado con espalda recta y agarre invertido es un ejercicio de fortalecimiento de los músculos de la espalda, en particular los dorsales, los romboides y los trapecios. Es adecuado para personas de todos los niveles de forma física que deseen mejorar la fuerza y la postura de la parte superior del cuerpo.

# exercise_15_name
source: Horizontal Rowing
es: Remo Horizontal

# exercise_15_description
source: Horizontal Row is a strength-building exercise that targets the muscles in your back, shoulders, and arms, making it ideal for those looking to improve upper body strength and posture.
es: Remo Horizontal es un ejercicio que fortalece los músculos de la espalda, los hombros y los brazos, por lo que es ideal para quienes desean mejorar la fuerza y la postura de la parte superior del cuerpo.

# exercise_16_name
source: Open Horizontal Rowing
es: Remo Horizontal Abierto

# exercise_16_description
source: Open Horizontal Row is a strength-building exercise that targets the muscles in your back, shoulders, and arms, contributing to improved posture and overall upper body strength.
es: El remo sentado bajo es un ejercicio que fortalece los músculos de la espalda, los hombros y los brazos, contribuyendo a mejorar la postura y la fuerza general de la parte superior del cuerpo.

# exercise_17_name
source: Horizontal Machine Row
es: Remo Horizontal en Máquina

# exercise_17_description
source: Horizontal Machine Row is a strength training exercise that primarily targets the muscles in the back, improving muscular endurance and promoting better posture.
es: Remo Horizontal en Máquina es un ejercicio de entrenamiento de fuerza que se dirige principalmente a los músculos de la espalda, mejorando la resistencia muscular y favoreciendo una mejor postura.

# exercise_18_name
source: T-Bar Row
es: Remo en Barra T

# exercise_18_description
source: T-Bar Row is a strength training exercise that primarily targets the muscles in your back, shoulders, and arms, offering a comprehensive upper body workout.
es: Remo en Barra T es un ejercicio de entrenamiento de fuerza que se dirige principalmente a los músculos de la espalda, los hombros y los brazos, ofreciendo un entrenamiento completo de la parte superior del cuerpo.

# exercise_19_name
source: Rear Delt Row
es: Remo con Barra

# exercise_19_description
source: Rear Delt Row is a strength training exercise that specifically targets the rear deltoids, helping to enhance shoulder stability and upper body strength.
es: El remo con Barra en posición horizontal es un ejercicio de entrenamiento de fuerza que se dirige principalmente a los músculos de la espalda, los hombros y los brazos, ofreciendo un entrenamiento completo de la parte superior del cuerpo.

# exercise_20_name
source: Reverse Barbell Row
es: Remo inverso con Barra

# exercise_20_description
source: Reverse Barbell Row is a strength-building exercise that primarily targets the muscles in your back, biceps, and forearms.
es: El remo inverso con Barra es un ejercicio de fortalecimiento que se dirige principalmente a los músculos de la espalda, los bíceps y los antebrazos.

# exercise_21_name
source: One Arm Row
es: Remo con mancuerna

# exercise_21_description
source: The One Arm Row is a strength training exercise that primarily targets the muscles in the back, but also works the biceps and shoulders, contributing to improved posture and upper body strength.
es: El Remo con mancuerna es un ejercicio de entrenamiento de fuerza que se dirige principalmente a los músculos de la espalda, pero también trabaja los bíceps y los hombros, contribuyendo a mejorar la postura y la fuerza de la parte superior del cuerpo.

# exercise_22_description
source: The Hack Squat is a lower body exercise that primarily targets the quadriceps, while also engaging the glutes and hamstrings, contributing to improved strength, balance, and muscle definition. Individuals might opt for the Sled Hack Squat because it offers a safer alternative to traditional squats, as it reduces strain on the back while still providing an effective workout for the lower body.
es: La Hack Squat es un ejercicio para la parte inferior del cuerpo que se dirige principalmente a los cuádriceps, a la vez que estimula los glúteos y los isquiotibiales, lo que contribuye a mejorar la fuerza, el equilibrio y la definición muscular. Las personas pueden optar por la sentadilla con trineo porque ofrece una alternativa más segura a las sentadillas tradicionales, ya que reduce la tensión en la espalda al tiempo que proporciona un entrenamiento eficaz para la parte inferior del cuerpo.

# exercise_23_name
source: Extension
es: Extensiones

# exercise_23_description
source: The Extension is a strength-building exercise that primarily targets the quadriceps, enhancing muscle tone, power, and endurance in the lower body.
es: Las extensiónes de piernas es un ejercicio de fortalecimiento que se dirige principalmente a los cuádriceps, mejorando el tono muscular, la potencia y la resistencia de la parte inferior del cuerpo.

# exercise_24_name
source: Incline Press
es: Prensa Inclinada

# exercise_24_description
source: The Incline Press is a comprehensive lower body exercise that primarily targets the quadriceps, while also engaging the glutes, hamstrings, and calves. This exercise is suitable for both beginners and advanced fitness enthusiasts as it can be easily adjusted to match individual strength levels.
es: La Prensa Inclinada es un ejercicio completo para la parte inferior del cuerpo que se dirige principalmente a los cuádriceps, a la vez que estimula los glúteos, los isquiotibiales y los gemelos. Este ejercicio es adecuado tanto para principiantes como para entusiastas avanzados del fitness, ya que puede ajustarse fácilmente a los niveles de fuerza individuales.

# exercise_25_name
source: Barbell Squat
es: Sentadilla con barra

# exercise_25_description
source: The Barbell Squat is a comprehensive lower body exercise that primarily targets the quadriceps, hamstrings, and glutes, while also engaging the core and improving balance. It is suitable for individuals at all fitness levels, from beginners to advanced athletes, due to its modifiable intensity and form. People would want to perform this exercise not only for its ability to build strength and muscle, but also for its benefits in enhancing flexibility, mobility, and overall functional fitness.
es: La sentadilla con barra es un ejercicio completo para la parte inferior del cuerpo que se dirige principalmente a los cuádriceps, los isquiotibiales y los glúteos, a la vez que activa el tronco y mejora el equilibrio. Es adecuado para personas de todos los niveles de forma física, desde principiantes hasta atletas avanzados, debido a su forma e intensidad modificables. La gente querría realizar este ejercicio no sólo por su capacidad para desarrollar fuerza y músculo, sino también por sus beneficios en la mejora de la flexibilidad, la movilidad y la aptitud funcional general.

# exercise_26_name
source: Smith Squat
es: Sentadilla en Smith
