Repository: Cristofer3097/gym
Catalog: l10n/app_*.arb
Languages: es

# exercise_26_description
source: The Smith Squat is a strength training exercise that primarily targets the glutes, quadriceps, and hamstrings, while also engaging the core and lower back.
es: La sentadilla Smith es un ejercicio de entrenamiento de fuerza que se dirige principalmente a los glúteos, los cuádriceps y los isquiotibiales, a la vez que estimula el tronco y la zona lumbar.

# exercise_27_name
source: Adductor in Machine
es: Aductores en Máquina

# exercise_27_description
source: The Adductor in Machine is a targeted strength exercise that focuses on the inner thigh muscles, primarily the adductor group. This exercise is beneficial not only for improving overall leg aesthetics, but also for enhancing performance in movements and sports that require strong, stable hips and thighs.
es: Los Aductores en Máquina es un ejercicio de fuerza dirigido que se centra en los músculos de la cara interna del muslo, principalmente en el grupo de los aductores. Este ejercicio es beneficioso no sólo para mejorar la estética general de las piernas, sino también para mejorar el rendimiento en movimientos y deportes que requieren caderas y muslos fuertes y estables.

# exercise_28_name
source: Machine Lateral Raises
es: Elevaciónes Laterales en Maquina

# exercise_28_description
source: The Machine Lateral Raises is a strength training exercise that primarily targets the shoulders, specifically the lateral deltoids, aiding in the development of broader, stronger shoulders.
es: La elevaciónes laterales en maquina es un ejercicio de entrenamiento de fuerza que se dirige principalmente a los hombros, en concreto a los deltoides laterales, lo que contribuye al desarrollo de unos hombros más anchos y fuertes.

# exercise_29_name
source: Dumbbell Lateral Raises
es: Elevaciones Laterales con mancuerna

# exercise_29_description
source: The Lateral Raise is a strength training exercise that primarily targets the deltoids, helping to build shoulder width and definition. It's suitable for individuals at any fitness level, from beginners to advanced athletes, looking to improve upper body strength and posture. People may want to incorporate Lateral Raises into their routine to enhance shoulder stability, promote balanced muscle development, and improve daily functional movements.
es: La elevación lateral es un ejercicio de entrenamiento de fuerza dirigido principalmente a los deltoides, que ayuda a aumentar la anchura y la definición de los hombros. Es adecuado para personas de cualquier nivel de forma física, desde principiantes hasta atletas avanzados, que deseen mejorar la fuerza y la postura de la parte superior del cuerpo. Las personas pueden incorporar las Elevaciones laterales a su rutina para mejorar la estabilidad de los hombros, promover un desarrollo muscular equilibrado y mejorar los movimientos funcionales diarios.

# exercise_30_name
source: Lateral Raises on Cables
es: Elevaciones laterales con cable

# exercise_30_description
source: The Lateral Raises on Cables is a strength-building exercise that primarily targets the deltoids, enhancing shoulder definition and improving overall upper body strength.
es: La elevación lateral de un brazo con cable es un ejercicio de fortalecimiento que se dirige principalmente a los deltoides, mejorando la definición de los hombros y la fuerza general de la parte superior del cuerpo.

# exercise_31_name
source: Dumbbell Shoulder Press
es: Press de Hombro con Mancuernas

# exercise_31_description
source: The Dumbbell Shoulder Press is a highly effective upper body exercise that targets the deltoids, triceps, and upper pectoral muscles, promoting improved strength and muscle tone.
es: El press de Hombro con mancuernas es un ejercicio muy eficaz para la parte superior del cuerpo que trabaja los deltoides, los tríceps y los músculos pectorales superiores, mejorando la fuerza y el tono muscular.

# exercise_32_name
source: Shoulder Press on Machine
es: Press de Hombro en Máquina

# exercise_32_description
source: The Shoulder Press on Machine is a strength-building exercise targeting the deltoids, triceps, and upper body muscles, making it highly beneficial for those aiming to enhance their upper body strength.
es: El Press de Hombro en Máquina es un ejercicio de fortalecimiento de los deltoides, los tríceps y los músculos de la parte superior del cuerpo, por lo que resulta muy beneficioso para quienes desean mejorar la fuerza de la parte superior del cuerpo.

# exercise_33_name
source: Shoulder Press Smith
es: Press de Hombro en Smith

# exercise_33_description
source: The Shoulder Press Smith is a strength-building exercise that primarily targets the deltoids, triceps, and upper body muscles, offering a comprehensive workout for your upper body. It is suitable for both beginners and advanced fitness enthusiasts as it allows for controlled movements and adjustable weights.
es: El press de Hombro Smith es un ejercicio de fortalecimiento que se dirige principalmente a los deltoides, los tríceps y los músculos de la parte superior del cuerpo, ofreciendo un entrenamiento completo para la parte superior del cuerpo. Es adecuado tanto para principiantes como para entusiastas avanzados del fitness, ya que permite movimientos controlados y pesos ajustables.

# exercise_34_name
source: Dumbbell Front Raise
es: Elevaciones Frontales con Mancuernas

# exercise_34_description
source: The Dumbbell Front Raise is a strength-building exercise that primarily targets the shoulders, specifically the anterior deltoids, and also works the upper chest muscles.
es: La elevación frontal con mancuernas es un ejercicio de fortalecimiento que se dirige principalmente a los hombros, concretamente a los deltoides anteriores, y también trabaja los músculos de la parte superior del pecho.

# exercise_35_name
source: Lever Reverse Fly
es: Fly Invertido en Maquina

# exercise_35_description
source: The Lever Reverse Fly is a strength training exercise that primarily targets and enhances the muscles in your upper back, shoulders, and arms. It is ideal for individuals at an intermediate fitness level who are looking to improve their upper body strength and posture.
es: El ejercicio Fly invertido en maquina es un ejercicio de entrenamiento de fuerza que se dirige principalmente a mejorar los músculos de la parte superior de la espalda, los hombros y los brazos. Es ideal para personas con un nivel de condición física intermedio que desean mejorar la fuerza y la postura de la parte superior del cuerpo.

# exercise_36_name
source: Rear Fly
es: Fly Invertido con Mancuernas

# exercise_36_description
source: The Rear Fly is a strength training exercise that primarily targets the muscles in the upper back, shoulders, and arms, contributing to improved posture and enhanced muscle definition. People may choose this exercise for its ability to be easily modified, its effectiveness in building upper body strength, and its role in creating a balanced, well-rounded fitness routine.
es: El Fly Invertido con Mancuernas es un ejercicio de entrenamiento de fuerza que se dirige principalmente a los músculos de la parte superior de la espalda, los hombros y los brazos, lo que contribuye a mejorar la postura y la definición muscular. Las personas pueden elegir este ejercicio por su facilidad de modificación, su eficacia en el desarrollo de la fuerza de la parte superior del cuerpo y su papel en la creación de una rutina de fitness equilibrada y completa.

# exercise_37_name
source: Barbell Curl
es: Curl con barra

# exercise_37_description
source: The Barbell Curl is a strength training exercise designed to target the biceps and improve upper body strength. It is suitable for anyone, from beginners to advanced athletes, who are looking to build muscle mass and enhance arm definition.
es: El Curl con barra es un ejercicio de entrenamiento de fuerza diseñado para trabajar los bíceps y mejorar la fuerza de la parte superior del cuerpo. Es adecuado para cualquier persona, desde principiantes hasta atletas avanzados, que busquen aumentar la masa muscular y mejorar la definición de los brazos.

# exercise_38_name
source: Biceps Curl
es: Curl de Biceps

# exercise_38_description
source: The Biceps Curl is a strength training exercise that primarily targets the biceps muscles, promoting muscle growth and endurance in the upper arms. This exercise is suitable for individuals at all fitness levels, from beginners to advanced athletes, due to its adjustable intensity. People may want to perform Biceps Curls not only to enhance their arm strength and tone, but also to improve their overall lifting capability, making daily tasks easier.
es: El Curl de bíceps es un ejercicio de entrenamiento de fuerza que se dirige principalmente a los músculos bíceps, promoviendo el crecimiento muscular y la resistencia en la parte superior de los brazos. Este ejercicio es adecuado para personas de todos los niveles de forma física, desde principiantes hasta atletas avanzados, debido a su intensidad ajustable. Las personas pueden querer realizar Curl de bíceps no sólo para mejorar la fuerza y el tono de sus brazos, sino también para mejorar su capacidad general de levantamiento, facilitando las tareas diarias.

# exercise_39_name
source: Concentration Curl
es: Curl de concentrado

# exercise_39_description
source: The Concentration Curl is a highly effective exercise that primarily targets the biceps, promoting muscle growth and strength. People might opt for this exercise as it focuses on the isolation of the bicep muscle, leading to improved muscle definition and size.
es: El Curl de concentrado es un ejercicio muy eficaz que se dirige principalmente a los bíceps, promoviendo el crecimiento muscular y la fuerza.La gente puede optar por este ejercicio, ya que se centra en el aislamiento del músculo bíceps, lo que conduce a una mejor definición muscular y el tamaño.

# exercise_40_name
source: Overhead Curl
es: Curl por encima de la cabeza

# exercise_40_description
source: The Overhead Curl is a strength training exercise that primarily targets the biceps and shoulders, helping to enhance upper body strength and improve muscle definition. This exercise is ideal for both beginners and advanced fitness enthusiasts as it can be easily adjusted to match individual fitness levels. Incorporating Overhead Curls into your workout routine can aid in improving arm strength and stability, making it a beneficial exercise for those who are looking to improve their performance in sports or daily activities that require upper body strength.
es: El Curl por encima de la cabeza es un ejercicio de entrenamiento de fuerza dirigido principalmente a los bíceps y los hombros, que ayuda a aumentar la fuerza de la parte superior del cuerpo y a mejorar la definición muscular. Este ejercicio es ideal tanto para principiantes como para entusiastas avanzados del fitness, ya que puede ajustarse fácilmente a cada nivel de forma física. La incorporación de los rizos por encima de la cabeza a su rutina de entrenamiento puede ayudar a mejorar la fuerza y la estabilidad de los brazos, lo que lo convierte en un ejercicio beneficioso para aquellos que buscan mejorar su rendimiento en el deporte o en las actividades diarias que requieren fuerza en la parte superior del cuerpo.

# exercise_41_name
source: Lever Preacher Curl
es: Curl de Predicador en Maquina

# exercise_41_description
source: The Lever Preacher Curl is a strength-training exercise that focuses on isolating the biceps, providing a more targeted workout for muscle growth and toning. It's ideal for both beginners and advanced fitness enthusiasts who are looking to improve their upper body strength and definition. People would want to incorporate this exercise into their routine as it promotes better arm stability, enhances muscle symmetry, and contributes to overall upper body aesthetics.
es: El Curl de Predicador en maquina es un ejercicio de entrenamiento de fuerza que se centra en aislar los bíceps, proporcionando un entrenamiento más específico para el crecimiento muscular y la tonificación. Es ideal tanto para principiantes como para entusiastas avanzados del fitness que buscan mejorar la fuerza y definición de la parte superior del cuerpo. La gente querría incorporar este ejercicio a su rutina, ya que promueve una mejor estabilidad de los brazos, mejora la simetría muscular y contribuye a la estética general de la parte superior del cuerpo.

# exercise_42_name
source: Barbell Preacher Curl
es: Curl de Predicador con Barra

# exercise_42_description
source: The Barbell Preacher Curl is a highly effective exercise for targeting and isolating the biceps, particularly the brachialis muscle, leading to enhanced arm strength and size.
es: El Curl de Predicador con Barra es un ejercicio muy eficaz para trabajar y aislar los bíceps, especialmente el músculo braquial, lo que mejora la fuerza y el tamaño de los brazos.

# exercise_43_name
source: Barbell Spider Curl
es: Curl Araña con Barra

# exercise_43_description
source: The Barbell Spider Curl is a targeted exercise designed to isolate and enhance the biceps by reducing help from other muscle groups. This exercise is ideal for individuals looking to improve their upper body strength, particularly those wanting to define and sculpt their arm muscles.
es: El Curl araña con Barra es un ejercicio específico diseñado para aislar y mejorar los bíceps reduciendo la ayuda de otros grupos musculares. Este ejercicio es ideal para las personas que desean mejorar la fuerza de la parte superior del cuerpo, en particular las que desean definir y esculpir los músculos de los brazos.

# exercise_44_name
source: Isolated Biceps Curl
es: Curl de Bíceps Aislado

# exercise_44_description
source: The Cable One Arm Biceps Curl is a strength-building exercise targeting the biceps and providing an intense isolation workout. This exercise is especially beneficial for those who want to focus on muscle symmetry and balance, as it allows for the independent workout of each arm, helping to prevent or correct any strength imbalances.
es: El Curl de bíceps aislado es un ejercicio de fortalecimiento dirigido a los bíceps que proporciona un intenso entrenamiento de aislamiento. Este ejercicio es especialmente beneficioso para aquellos que quieren centrarse en la simetría y el equilibrio muscular, ya que permite el entrenamiento independiente de cada brazo, ayudando a prevenir o corregir cualquier desequilibrio de fuerza.

# exercise_45_name
source: Inclined Curl
es: Curl Inclinado

# exercise_45_description
source: The Inclined Curl is a strength training exercise that specifically targets the biceps, promoting muscle growth and enhancing arm strength.
es: El Curl inclinado es un ejercicio de entrenamiento de fuerza que se dirige específicamente a los bíceps, promoviendo el crecimiento muscular y mejorando la fuerza de los brazos.

# exercise_46_name
source: Triceps Pushdown
es: Cables para Triceps

# exercise_46_description
source: The Triceps Pushdown is a strength training exercise that primarily targets the triceps muscles, helping to improve upper body strength and muscle definition. It's suitable for individuals at all fitness levels, from beginners to advanced, as it can be easily adjusted based on strength and skill.
es: Los Cables para Triceps es un ejercicio de entrenamiento de fuerza que se dirige principalmente a los músculos tríceps, ayudando a mejorar la fuerza de la parte superior del cuerpo y la definición muscular. Es adecuado para personas de todos los niveles de forma física, desde principiantes hasta avanzados, ya que puede ajustarse fácilmente en función de la fuerza y la destreza. Las personas pueden optar por incorporar este ejercicio a su rutina de entrenamiento para aumentar la fuerza de los brazos, mejorar el rendimiento atlético o conseguir unos brazos tonificados y esculpidos.

# exercise_47_name
source: Cross Triceps Extension
es: Extensión de Tríceps con Cable

# exercise_47_description
source: The Cross Triceps Extension is a strength-building exercise that primarily targets the triceps, while also engaging the shoulders and core muscles.
es: La extensión de tríceps con cable es un ejercicio de fortalecimiento que se dirige principalmente a los tríceps, a la vez que se trabajan los hombros y los músculos centrales.

# exercise_48_name
source: One Arm Triceps Extension
es: Copa individual

# exercise_48_description
source: The One Arm Triceps Extension is a strength-building exercise designed to isolate and develop the triceps muscle, contributing to improved upper body strength and toned arms.
es: La Copa individual es un ejercicio de fortalecimiento diseñado para aislar y desarrollar el músculo tríceps, lo que contribuye a mejorar la fuerza de la parte superior del cuerpo y a tonificar los brazos.

# exercise_49_name
source: Triceps Extension
es: Çopa para Tricep

# exercise_49_description
source: The Triceps Extension is a strength training exercise that specifically targets and isolates the triceps muscles, promoting muscle growth and endurance.
es: La copa para tricep es un eficaz ejercicio de entrenamiento de fuerza que se dirige principalmente a los tríceps, ayudando a mejorar el tono y la definición muscular.

# exercise_50_name
source: Overhead Tricep Extension
es: Extencion de Tricep por Encima de la Cabeza

# exercise_50_description
source: The Overhead Tricep Extension is a strength-building exercise specifically designed to target and isolate the tricep muscles, contributing to well-defined arms. I
es: La extensión de tríceps por encima de la cabeza es un ejercicio de desarrollo de la fuerza diseñado específicamente para trabajar y aislar los músculos del tríceps, lo que contribuye a unos brazos bien definidos.

# exercise_51_name
source: Barbell Lying Triceps Extension
es: Extension de Triceps Tumbado con Barra

# exercise_51_description
source: The Barbell Lying Triceps Extension, also known as Skull Crusher, is a strength training exercise that predominantly targets the triceps muscles, contributing to upper body strength and toned arms.
es: La extensión de tríceps tumbado con barra, también conocida como Rompe Craneo, es un ejercicio de entrenamiento de fuerza que se dirige principalmente a los músculos tríceps, lo que contribuye a la fuerza de la parte superior del cuerpo y a unos brazos tonificados.

# exercise_52_name
source: Lever Seated Crunch
es: Flexión Sentado en Maquina

# exercise_52_description
source: The Lever Seated Crunch is a targeted exercise that primarily strengthens the core muscles, particularly the abs, and enhances overall body stability.People would want to perform this exercise due to its effectiveness in developing a strong and toned midsection, contributing to better balance and reduced risk of back pain.
es: La flexión sentado en maquina es un ejercicio específico que fortalece principalmente los músculos centrales, en particular los abdominales, y mejora la estabilidad general del cuerpo.La gente querría realizar este ejercicio debido a su eficacia en el desarrollo de una sección media fuerte y tonificada, lo que contribuye a un mejor equilibrio y un menor riesgo de dolor de espalda.

# exercise_53_name
source: Cable Kneeling Crunch
es: Flexión de Rodillas con Cable

# exercise_53_description
source: The Cable Kneeling Crunch is a core exercise that targets the abdominal muscles, specifically enhancing strength and definition. Individuals would want to incorporate this exercise into their routine as it not only helps in achieving a toned midsection but also improves posture, balance, and reduces the risk of back pain.
es: La Flexión de Rodillas con Cable es un ejercicio para el tronco que se dirige a los músculos abdominales, mejorando específicamente su fuerza y definición.Las personas querrán incorporar este ejercicio a su rutina, ya que no sólo ayuda a conseguir una sección media tonificada, sino que también mejora la postura, el equilibrio y reduce el riesgo de dolor de espalda.

# exercise_54_description
source: The Hip Thrust is a strength training exercise primarily targeting the glutes, hamstrings, and core, making it an effective workout for enhancing lower body strength and improving hip power.Incorporating hip thrusts into your fitness routine can help improve your speed, jumping abilities, overall athletic performance, and even aid in preventing injuries associated with weak glute muscles.
es: El Hip Thrust es un ejercicio de entrenamiento de fuerza dirigido principalmente a los glúteos, los isquiotibiales y el tronco, lo que lo convierte en un entrenamiento eficaz para aumentar la fuerza de la parte inferior del cuerpo y mejorar la potencia de la cadera. Incorporar los empujes de cadera a su rutina de ejercicios puede ayudarle a mejorar su velocidad, su capacidad de salto, su rendimiento atlético general e incluso a prevenir lesiones asociadas a la debilidad de los músculos de los glúteos.

# exercise_55_name
source: Bulgarian Split Squat
es: Sentadilla Bulgara

# exercise_55_description
source: The Bulgarian Split Squat is a highly effective lower-body exercise that targets the quadriceps, glutes, and hamstrings, while also improving balance and mobility.
es: La sentadilla búlgara es un ejercicio muy eficaz para la parte inferior del cuerpo que trabaja los cuádriceps, los glúteos y los isquiotibiales, al tiempo que mejora el equilibrio y la movilidad.

# exercise_56_name
source: Lever Hip Extension
es: Extensión de Gluteo en Maquina

# exercise_56_description
source: The Lever Hip Extension is a targeted exercise that primarily strengthens the gluteus maximus and hamstrings, contributing to improved balance, posture, and athletic performance. People would want to perform this exercise to enhance lower body strength, support functional movements in daily life, and promote overall body stability and flexibility.
es: La extensión de Gluteo en maquina es un ejercicio específico que fortalece principalmente el glúteo mayor y los isquiotibiales, lo que contribuye a mejorar el equilibrio, la postura y el rendimiento deportivo. Las personas desearían realizar este ejercicio para mejorar la fuerza de la parte inferior del cuerpo, apoyar los movimientos funcionales en la vida diaria y promover la estabilidad y flexibilidad general del cuerpo.

# exercise_57_name
source: Romanian Deadlift
es: Peso Muerto Rumano

# exercise_57_description
source: The Romanian Deadlift is a highly effective exercise that primarily targets the muscles of the posterior chain, including the hamstrings, glutes, and lower back, contributing to improved strength, balance, and posture. It is suitable for both beginners and advanced fitness enthusiasts as it can be modified to match individual fitness levels. Individuals may want to incorporate this exercise into their routine to enhance functional strength, promote muscle growth, and improve overall athletic performance.
es: El peso muerto rumano es un ejercicio muy eficaz que trabaja principalmente los músculos de la cadena posterior, incluidos los isquiotibiales, los glúteos y la zona lumbar, lo que contribuye a mejorar la fuerza, el equilibrio y la postura. Es adecuado tanto para principiantes como para entusiastas avanzados del fitness, ya que puede modificarse para adaptarse a los distintos niveles de forma física. Las personas pueden incorporar este ejercicio a su rutina para aumentar la fuerza funcional, promover el crecimiento muscular y mejorar el rendimiento atlético general.

# predefined_template_chest_routine_full_name
source: Complete Chest Routine
es: Rutina de Pecho Completa

# predefined_template_back_strong_name
source: Strong Back
es: Espalda Fuerte

# predefined_template_leg_day_basic_name
source: Basic Leg Day
es: Día de Pierna Básico

# predefined_template_shoulders_steel_name
source: Steel Shoulders
es: Hombros de Acero
