Repository: Cristofer3097/gym
Catalog: l10n/app_*.arb
Languages: es

# predefined_template_arms_toned_name
source: Toned Arms
es: Brazos Tonificados
